CREATE TABLE Users
(
	[ID] INT PRIMARY KEY IDENTITY,
	[Name] NVARCHAR(32),
	[Birthdate] DATE,
	[Stars] INT
);

INSERT INTO Users ([Name], [Birthdate], [Stars])
VALUES 
	(N'Петрович'   , '2000-01-10', 3    ),
	(N'Михалыч'    , '1999-10-10', 10   ),
	(N'Павловна'   , '2001-05-10', 7    ),
	(N'Ильинична'  , '1990-03-10', 5    ),
	(N'Кузьмич'    , '1980-07-10', 8    ),
	(N'Сергеевич'  , '2005-02-10', 11   ),
	(N'Андреевич'  , '2004-03-10', 3    ),
	(N'Николаевна' , '2002-09-10', 7    ),
	(N'Дмитрич'    , '2003-08-10', 0    ),
	(N'Алексеевна' , '2001-06-10', NULL ),
	(N'Игоревич'   , '2004-03-10', NULL )
