INSERT INTO Shop_Products
    ( ID, Name,                      Price   )
VALUES
    ( 1,  N'Гвоздь 100мм',           10.50   ),
    ( 2,  N'Шуруп 4х35',             4.25    ),
    ( 3,  N'Гайка М4',               6.50    ),
    ( 4,  N'Гровер М4',              5.99    ),
    ( 5,  N'Болт 4х60',              9.98    ),
    ( 6,  N'Гвоздь 80мм',            19.98   ),
    ( 7,  N'Отвертка PZ2',           35.50   ),
    ( 8,  N'Шуруповерт',             799     ),
    ( 9,  N'Молоток',                216.50  ),
    ( 10, N'Набор "Новосел"',        52.40   ),
    ( 11, N'Сверло 6х80',            39.98   ),
    ( 12, N'Шуруп 5х45',             5.98    ),
    ( 13, N'Винт "потай" 3х16',      3.98    ),
    ( 14, N'Дюбель 6х60',            5.50    ),
    ( 15, N'Органайзер для шурупов', 199     ),
    ( 16, N'Лазерный дальномер',     1950    ),
    ( 17, N'Дрель электрическая',    990     ),
    ( 18, N'Сварочный аппарат',      2099    ),
    ( 19, N'Электроды 3мм',          49.98   ),
    ( 20, N'Паяльник 40 Вт',         199.98  )